Revit 2027 API
FilterInverseRule Class
 A filter rule that inverts the boolean values returned by the rule it contains.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterInverseRule
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FilterInverseRule : FilterRule
Public Class FilterInverseRule
	Inherits FilterRule
public ref class FilterInverseRule : public FilterRule
type FilterInverseRule =
    class
        inherit FilterRule
    end
The FilterInverseRule type exposes the following members.
Constructors
Name | Description
FilterInverseRule |  Constructs a new instance of FilterInverseRule.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from FilterRule)
Top
Methods
Name | Description
Dispose
(Inherited from FilterRule)
ElementPasses |  Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
(Inherited from FilterRule)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInnerRule |  Gets the rule being inverted.
GetRuleParameter |  Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.
(Inherited from FilterRule)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetInnerRule |  Gets the rule being inverted.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 FilterInverse rule performs a logical "not" operation on its inner rule's "elementPasses()" method.
See Also
Reference
Autodesk.Revit.DB Namespace